"""
    Цикл for
    Цикл перебирает значения любых коллекций (Строки, Списки, Множества и т.д.)

    for <переменная> in <коллекция>:
        <операторы>
"""

# Перебор значений строки (по каждой букве)
for i in "hello":
    print(i)

# Вывести все числа от 0 до 10 (не включительно)
for i in range(10):
    print(i)
